espressif/esp-idf/components/soc/esp32s31/register/soc/bus_monitor_reg.h
/** BUS_MONITOR_CORE_0_TRACE_LOCKUP_IADDR_1_REG register
 *  TRACE lockup iaddr logging register
 */
#define BUS_MONITOR_CORE_0_TRACE_LOCKUP_IADDR_1_REG (DR_REG_BUS_MONITOR_BASE + 0x80)
/** BUS_MONITOR_CORE_0_TRACE_LOCKUP_RECORDING_IADDR_1 : RO; bitpos: [31:0]; default: 0;
 *  Represents the last lockup iaddr
 */
#define BUS_MONITOR_CORE_0_TRACE_LOCKUP_RECORDING_IADDR_1    0xFFFFFFFFU
#define BUS_MONITOR_CORE_0_TRACE_LOCKUP_RECORDING_IADDR_1_M  (BUS_MONITOR_CORE_0_TRACE_LOCKUP_RECORDING_IADDR_1_V << BUS_MONITOR_CORE_0_TRACE_LOCKUP_RECORDING_IADDR_1_S)
#define BUS_MONITOR_CORE_0_TRACE_LOCKUP_RECORDING_IADDR_1_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_0_TRACE_LOCKUP_RECORDING_IADDR_1_S  0

/** BUS_MONITOR_CORE_0_TRACE_LOCKUP_PRIV_1_REG register
 *  TRACE lockup priv logging register
 */
#define BUS_MONITOR_CORE_0_TRACE_LOCKUP_PRIV_1_REG (DR_REG_BUS_MONITOR_BASE + 0x84)
/** BUS_MONITOR_CORE_0_TRACE_LOCKUP_RECORDING_PRIV_1 : RO; bitpos: [1:0]; default: 0;
 *  Represents the last lockup priv
 */
#define BUS_MONITOR_CORE_0_TRACE_LOCKUP_RECORDING_PRIV_1    0x00000003U
#define BUS_MONITOR_CORE_0_TRACE_LOCKUP_RECORDING_PRIV_1_M  (BUS_MONITOR_CORE_0_TRACE_LOCKUP_RECORDING_PRIV_1_V << BUS_MONITOR_CORE_0_TRACE_LOCKUP_RECORDING_PRIV_1_S)
#define BUS_MONITOR_CORE_0_TRACE_LOCKUP_RECORDING_PRIV_1_V  0x00000003U
#define BUS_MONITOR_CORE_0_TRACE_LOCKUP_RECORDING_PRIV_1_S  0

/** BUS_MONITOR_CORE_1_MONTR_ENA_REG register
 *  core1 monitor enable configuration register
 */
#define BUS_MONITOR_CORE_1_MONTR_ENA_REG (DR_REG_BUS_MONITOR_BASE + 0x88)
/** BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_ENA : R/W; bitpos: [0]; default: 0;
 *  Configures whether to monitor read operations in region 0 by the Data bus.
 *  0: Not monitor
 *  1: Monitor
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_ENA    (BIT(0))
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_ENA_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_ENA_V << BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_ENA_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_ENA_S  0
/** BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_ENA : R/W; bitpos: [1]; default: 0;
 *  Configures whether to monitor write operations in region 0 by the Data bus.
 *  0: Not monitor
 *  1: Monitor
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_ENA    (BIT(1))
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_ENA_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_ENA_V << BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_ENA_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_ENA_S  1
/** BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_ENA : R/W; bitpos: [2]; default: 0;
 *  Configures whether to monitor read operations in region 1 by the Data bus.
 *  0: Not Monitor
 *  1: Monitor
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_ENA    (BIT(2))
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_ENA_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_ENA_V << BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_ENA_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_ENA_S  2
/** BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_ENA : R/W; bitpos: [3]; default: 0;
 *  Configures whether to monitor write operations in region 1 by the Data bus.
 *  0: Not Monitor
 *  1: Monitor
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_ENA    (BIT(3))
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_ENA_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_ENA_V << BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_ENA_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_ENA_S  3
/** BUS_MONITOR_CORE_1_AREA_PIF_0_RD_ENA : R/W; bitpos: [4]; default: 0;
 *  Configures whether to monitor read operations in region 0 by the Peripheral bus.
 *  0: Not Monitor
 *  1: Monitor
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_0_RD_ENA    (BIT(4))
#define BUS_MONITOR_CORE_1_AREA_PIF_0_RD_ENA_M  (BUS_MONITOR_CORE_1_AREA_PIF_0_RD_ENA_V << BUS_MONITOR_CORE_1_AREA_PIF_0_RD_ENA_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_0_RD_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_PIF_0_RD_ENA_S  4
/** BUS_MONITOR_CORE_1_AREA_PIF_0_WR_ENA : R/W; bitpos: [5]; default: 0;
 *  Configures whether to monitor write operations in region 0 by the Peripheral bus.
 *  0: Not Monitor
 *  1: Monitor
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_0_WR_ENA    (BIT(5))
#define BUS_MONITOR_CORE_1_AREA_PIF_0_WR_ENA_M  (BUS_MONITOR_CORE_1_AREA_PIF_0_WR_ENA_V << BUS_MONITOR_CORE_1_AREA_PIF_0_WR_ENA_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_0_WR_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_PIF_0_WR_ENA_S  5
/** BUS_MONITOR_CORE_1_AREA_PIF_1_RD_ENA : R/W; bitpos: [6]; default: 0;
 *  Configures whether to monitor read operations in region 1 by the Peripheral bus.
 *  0: Not Monitor
 *  1: Monitor
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_1_RD_ENA    (BIT(6))
#define BUS_MONITOR_CORE_1_AREA_PIF_1_RD_ENA_M  (BUS_MONITOR_CORE_1_AREA_PIF_1_RD_ENA_V << BUS_MONITOR_CORE_1_AREA_PIF_1_RD_ENA_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_1_RD_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_PIF_1_RD_ENA_S  6
/** BUS_MONITOR_CORE_1_AREA_PIF_1_WR_ENA : R/W; bitpos: [7]; default: 0;
 *  Configures whether to monitor write operations in region 1 by the Peripheral bus.
 *  0: Not Monitor
 *  1: Monitor
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_1_WR_ENA    (BIT(7))
#define BUS_MONITOR_CORE_1_AREA_PIF_1_WR_ENA_M  (BUS_MONITOR_CORE_1_AREA_PIF_1_WR_ENA_V << BUS_MONITOR_CORE_1_AREA_PIF_1_WR_ENA_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_1_WR_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_PIF_1_WR_ENA_S  7
/** BUS_MONITOR_CORE_1_SP_SPILL_MIN_ENA : R/W; bitpos: [8]; default: 0;
 *  Configures whether to monitor SP exceeding the lower bound address of SP monitored
 *  region.
 *  0: Not Monitor
 *  1: Monitor
 */
#define BUS_MONITOR_CORE_1_SP_SPILL_MIN_ENA    (BIT(8))
#define BUS_MONITOR_CORE_1_SP_SPILL_MIN_ENA_M  (BUS_MONITOR_CORE_1_SP_SPILL_MIN_ENA_V << BUS_MONITOR_CORE_1_SP_SPILL_MIN_ENA_S)
#define BUS_MONITOR_CORE_1_SP_SPILL_MIN_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_SP_SPILL_MIN_ENA_S  8
/** BUS_MONITOR_CORE_1_SP_SPILL_MAX_ENA : R/W; bitpos: [9]; default: 0;
 *  Configures whether to monitor SP exceeding the upper bound address of SP monitored
 *  region.
 *  0: Not Monitor
 *  1: Monitor
 */
#define BUS_MONITOR_CORE_1_SP_SPILL_MAX_ENA    (BIT(9))
#define BUS_MONITOR_CORE_1_SP_SPILL_MAX_ENA_M  (BUS_MONITOR_CORE_1_SP_SPILL_MAX_ENA_V << BUS_MONITOR_CORE_1_SP_SPILL_MAX_ENA_S)
#define BUS_MONITOR_CORE_1_SP_SPILL_MAX_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_SP_SPILL_MAX_ENA_S  9
/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_ENA : R/W; bitpos: [12]; default: 0;
 *  trace lockup monitor enable
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_ENA    (BIT(12))
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_ENA_M  (BUS_MONITOR_CORE_1_TRACE_LOCKUP_ENA_V << BUS_MONITOR_CORE_1_TRACE_LOCKUP_ENA_S)
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_ENA_S  12

/** BUS_MONITOR_CORE_1_INTR_RAW_REG register
 *  core1 monitor interrupt status register
 */
#define BUS_MONITOR_CORE_1_INTR_RAW_REG (DR_REG_BUS_MONITOR_BASE + 0x8c)
/** BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_RAW : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status of read operations in region 0 by Data bus.
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_RAW    (BIT(0))
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_RAW_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_RAW_V << BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_RAW_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_RAW_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_RAW_S  0
/** BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_RAW : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status of write operations in region 0 by Data bus.
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_RAW    (BIT(1))
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_RAW_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_RAW_V << BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_RAW_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_RAW_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_RAW_S  1
/** BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_RAW : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status of read operations in region 1 by Data bus.
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_RAW    (BIT(2))
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_RAW_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_RAW_V << BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_RAW_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_RAW_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_RAW_S  2
/** BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_RAW : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status of write operations in region 1 by Data bus.
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_RAW    (BIT(3))
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_RAW_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_RAW_V << BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_RAW_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_RAW_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_RAW_S  3
/** BUS_MONITOR_CORE_1_AREA_PIF_0_RD_RAW : RO; bitpos: [4]; default: 0;
 *  The raw interrupt status of read operations in region 0 by Peripheral bus.
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_0_RD_RAW    (BIT(4))
#define BUS_MONITOR_CORE_1_AREA_PIF_0_RD_RAW_M  (BUS_MONITOR_CORE_1_AREA_PIF_0_RD_RAW_V << BUS_MONITOR_CORE_1_AREA_PIF_0_RD_RAW_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_0_RD_RAW_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_PIF_0_RD_RAW_S  4
/** BUS_MONITOR_CORE_1_AREA_PIF_0_WR_RAW : RO; bitpos: [5]; default: 0;
 *  The raw interrupt status of write operations in region 0 by Peripheral bus.
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_0_WR_RAW    (BIT(5))
#define BUS_MONITOR_CORE_1_AREA_PIF_0_WR_RAW_M  (BUS_MONITOR_CORE_1_AREA_PIF_0_WR_RAW_V << BUS_MONITOR_CORE_1_AREA_PIF_0_WR_RAW_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_0_WR_RAW_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_PIF_0_WR_RAW_S  5
/** BUS_MONITOR_CORE_1_AREA_PIF_1_RD_RAW : RO; bitpos: [6]; default: 0;
 *  The raw interrupt status of read operations in region 1 by Peripheral bus.
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_1_RD_RAW    (BIT(6))
#define BUS_MONITOR_CORE_1_AREA_PIF_1_RD_RAW_M  (BUS_MONITOR_CORE_1_AREA_PIF_1_RD_RAW_V << BUS_MONITOR_CORE_1_AREA_PIF_1_RD_RAW_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_1_RD_RAW_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_PIF_1_RD_RAW_S  6
/** BUS_MONITOR_CORE_1_AREA_PIF_1_WR_RAW : RO; bitpos: [7]; default: 0;
 *  The raw interrupt status of write operations in region 1 by Peripheral bus.
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_1_WR_RAW    (BIT(7))
#define BUS_MONITOR_CORE_1_AREA_PIF_1_WR_RAW_M  (BUS_MONITOR_CORE_1_AREA_PIF_1_WR_RAW_V << BUS_MONITOR_CORE_1_AREA_PIF_1_WR_RAW_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_1_WR_RAW_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_PIF_1_WR_RAW_S  7
/** BUS_MONITOR_CORE_1_SP_SPILL_MIN_RAW : RO; bitpos: [8]; default: 0;
 *  The raw interrupt status of SP exceeding the lower bound address of SP monitored
 *  region.
 */
#define BUS_MONITOR_CORE_1_SP_SPILL_MIN_RAW    (BIT(8))
#define BUS_MONITOR_CORE_1_SP_SPILL_MIN_RAW_M  (BUS_MONITOR_CORE_1_SP_SPILL_MIN_RAW_V << BUS_MONITOR_CORE_1_SP_SPILL_MIN_RAW_S)
#define BUS_MONITOR_CORE_1_SP_SPILL_MIN_RAW_V  0x00000001U
#define BUS_MONITOR_CORE_1_SP_SPILL_MIN_RAW_S  8
/** BUS_MONITOR_CORE_1_SP_SPILL_MAX_RAW : RO; bitpos: [9]; default: 0;
 *  The raw interrupt status of SP exceeding the upper bound address of SP monitored
 *  region.
 */
#define BUS_MONITOR_CORE_1_SP_SPILL_MAX_RAW    (BIT(9))
#define BUS_MONITOR_CORE_1_SP_SPILL_MAX_RAW_M  (BUS_MONITOR_CORE_1_SP_SPILL_MAX_RAW_V << BUS_MONITOR_CORE_1_SP_SPILL_MAX_RAW_S)
#define BUS_MONITOR_CORE_1_SP_SPILL_MAX_RAW_V  0x00000001U
#define BUS_MONITOR_CORE_1_SP_SPILL_MAX_RAW_S  9

/** BUS_MONITOR_CORE_1_INTR_ENA_REG register
 *  core1 monitor interrupt enable register
 */
#define BUS_MONITOR_CORE_1_INTR_ENA_REG (DR_REG_BUS_MONITOR_BASE + 0x90)
/** BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_INTR_ENA : R/W; bitpos: [0]; default: 0;
 *  Core1 dram0 area0 read monitor interrupt enable
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_INTR_ENA    (BIT(0))
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_INTR_ENA_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_INTR_ENA_V << BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_INTR_ENA_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_INTR_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_INTR_ENA_S  0
/** BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_INTR_ENA : R/W; bitpos: [1]; default: 0;
 *  Core1 dram0 area0 write monitor interrupt enable
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_INTR_ENA    (BIT(1))
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_INTR_ENA_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_INTR_ENA_V << BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_INTR_ENA_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_INTR_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_INTR_ENA_S  1
/** BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_INTR_ENA : R/W; bitpos: [2]; default: 0;
 *  Core1 dram0 area1 read monitor interrupt enable
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_INTR_ENA    (BIT(2))
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_INTR_ENA_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_INTR_ENA_V << BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_INTR_ENA_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_INTR_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_INTR_ENA_S  2
/** BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_INTR_ENA : R/W; bitpos: [3]; default: 0;
 *  Core1 dram0 area1 write monitor interrupt enable
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_INTR_ENA    (BIT(3))
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_INTR_ENA_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_INTR_ENA_V << BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_INTR_ENA_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_INTR_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_INTR_ENA_S  3
/** BUS_MONITOR_CORE_1_AREA_PIF_0_RD_INTR_ENA : R/W; bitpos: [4]; default: 0;
 *  Core1 PIF area0 read monitor interrupt enable
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_0_RD_INTR_ENA    (BIT(4))
#define BUS_MONITOR_CORE_1_AREA_PIF_0_RD_INTR_ENA_M  (BUS_MONITOR_CORE_1_AREA_PIF_0_RD_INTR_ENA_V << BUS_MONITOR_CORE_1_AREA_PIF_0_RD_INTR_ENA_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_0_RD_INTR_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_PIF_0_RD_INTR_ENA_S  4
/** BUS_MONITOR_CORE_1_AREA_PIF_0_WR_INTR_ENA : R/W; bitpos: [5]; default: 0;
 *  Core1 PIF area0 write monitor interrupt enable
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_0_WR_INTR_ENA    (BIT(5))
#define BUS_MONITOR_CORE_1_AREA_PIF_0_WR_INTR_ENA_M  (BUS_MONITOR_CORE_1_AREA_PIF_0_WR_INTR_ENA_V << BUS_MONITOR_CORE_1_AREA_PIF_0_WR_INTR_ENA_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_0_WR_INTR_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_PIF_0_WR_INTR_ENA_S  5
/** BUS_MONITOR_CORE_1_AREA_PIF_1_RD_INTR_ENA : R/W; bitpos: [6]; default: 0;
 *  Core1 PIF area1 read monitor interrupt enable
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_1_RD_INTR_ENA    (BIT(6))
#define BUS_MONITOR_CORE_1_AREA_PIF_1_RD_INTR_ENA_M  (BUS_MONITOR_CORE_1_AREA_PIF_1_RD_INTR_ENA_V << BUS_MONITOR_CORE_1_AREA_PIF_1_RD_INTR_ENA_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_1_RD_INTR_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_PIF_1_RD_INTR_ENA_S  6
/** BUS_MONITOR_CORE_1_AREA_PIF_1_WR_INTR_ENA : R/W; bitpos: [7]; default: 0;
 *  Core1 PIF area1 write monitor interrupt enable
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_1_WR_INTR_ENA    (BIT(7))
#define BUS_MONITOR_CORE_1_AREA_PIF_1_WR_INTR_ENA_M  (BUS_MONITOR_CORE_1_AREA_PIF_1_WR_INTR_ENA_V << BUS_MONITOR_CORE_1_AREA_PIF_1_WR_INTR_ENA_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_1_WR_INTR_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_PIF_1_WR_INTR_ENA_S  7
/** BUS_MONITOR_CORE_1_SP_SPILL_MIN_INTR_ENA : R/W; bitpos: [8]; default: 0;
 *  Core1 stackpoint underflow monitor interrupt enable
 */
#define BUS_MONITOR_CORE_1_SP_SPILL_MIN_INTR_ENA    (BIT(8))
#define BUS_MONITOR_CORE_1_SP_SPILL_MIN_INTR_ENA_M  (BUS_MONITOR_CORE_1_SP_SPILL_MIN_INTR_ENA_V << BUS_MONITOR_CORE_1_SP_SPILL_MIN_INTR_ENA_S)
#define BUS_MONITOR_CORE_1_SP_SPILL_MIN_INTR_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_SP_SPILL_MIN_INTR_ENA_S  8
/** BUS_MONITOR_CORE_1_SP_SPILL_MAX_INTR_ENA : R/W; bitpos: [9]; default: 0;
 *  Core1 stackpoint overflow monitor interrupt enable
 */
#define BUS_MONITOR_CORE_1_SP_SPILL_MAX_INTR_ENA    (BIT(9))
#define BUS_MONITOR_CORE_1_SP_SPILL_MAX_INTR_ENA_M  (BUS_MONITOR_CORE_1_SP_SPILL_MAX_INTR_ENA_V << BUS_MONITOR_CORE_1_SP_SPILL_MAX_INTR_ENA_S)
#define BUS_MONITOR_CORE_1_SP_SPILL_MAX_INTR_ENA_V  0x00000001U
#define BUS_MONITOR_CORE_1_SP_SPILL_MAX_INTR_ENA_S  9

/** BUS_MONITOR_CORE_1_INTR_CLR_REG register
 *  core1 monitor interrupt clear register
 */
#define BUS_MONITOR_CORE_1_INTR_CLR_REG (DR_REG_BUS_MONITOR_BASE + 0x94)
/** BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_CLR : WT; bitpos: [0]; default: 0;
 *  Write 1 to clear the interrupt for read operations in region 0 by Data bus.
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_CLR    (BIT(0))
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_CLR_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_CLR_V << BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_CLR_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_CLR_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_RD_CLR_S  0
/** BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_CLR : WT; bitpos: [1]; default: 0;
 *  Write 1 to clear the interrupt for write operations in region 0 by Data bus.
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_CLR    (BIT(1))
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_CLR_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_CLR_V << BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_CLR_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_CLR_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_WR_CLR_S  1
/** BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_CLR : WT; bitpos: [2]; default: 0;
 *  Write 1 to clear the interrupt for read operations in region 1 by Data bus.
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_CLR    (BIT(2))
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_CLR_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_CLR_V << BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_CLR_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_CLR_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_RD_CLR_S  2
/** BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_CLR : WT; bitpos: [3]; default: 0;
 *  Write 1 to clear the interrupt for write operations in region 1 by Data bus.
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_CLR    (BIT(3))
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_CLR_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_CLR_V << BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_CLR_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_CLR_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_WR_CLR_S  3
/** BUS_MONITOR_CORE_1_AREA_PIF_0_RD_CLR : WT; bitpos: [4]; default: 0;
 *  Write 1 to clear the interrupt for read operations in region 0 by Peripheral bus.
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_0_RD_CLR    (BIT(4))
#define BUS_MONITOR_CORE_1_AREA_PIF_0_RD_CLR_M  (BUS_MONITOR_CORE_1_AREA_PIF_0_RD_CLR_V << BUS_MONITOR_CORE_1_AREA_PIF_0_RD_CLR_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_0_RD_CLR_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_PIF_0_RD_CLR_S  4
/** BUS_MONITOR_CORE_1_AREA_PIF_0_WR_CLR : WT; bitpos: [5]; default: 0;
 *  Write 1 to clear the interrupt for write operations in region 0 by Peripheral bus.
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_0_WR_CLR    (BIT(5))
#define BUS_MONITOR_CORE_1_AREA_PIF_0_WR_CLR_M  (BUS_MONITOR_CORE_1_AREA_PIF_0_WR_CLR_V << BUS_MONITOR_CORE_1_AREA_PIF_0_WR_CLR_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_0_WR_CLR_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_PIF_0_WR_CLR_S  5
/** BUS_MONITOR_CORE_1_AREA_PIF_1_RD_CLR : WT; bitpos: [6]; default: 0;
 *  Write 1 to clear the interrupt for read operations in region 1 by Peripheral bus.
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_1_RD_CLR    (BIT(6))
#define BUS_MONITOR_CORE_1_AREA_PIF_1_RD_CLR_M  (BUS_MONITOR_CORE_1_AREA_PIF_1_RD_CLR_V << BUS_MONITOR_CORE_1_AREA_PIF_1_RD_CLR_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_1_RD_CLR_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_PIF_1_RD_CLR_S  6
/** BUS_MONITOR_CORE_1_AREA_PIF_1_WR_CLR : WT; bitpos: [7]; default: 0;
 *  Write 1 to clear the interrupt for write operations in region 1 by Peripheral bus.
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_1_WR_CLR    (BIT(7))
#define BUS_MONITOR_CORE_1_AREA_PIF_1_WR_CLR_M  (BUS_MONITOR_CORE_1_AREA_PIF_1_WR_CLR_V << BUS_MONITOR_CORE_1_AREA_PIF_1_WR_CLR_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_1_WR_CLR_V  0x00000001U
#define BUS_MONITOR_CORE_1_AREA_PIF_1_WR_CLR_S  7
/** BUS_MONITOR_CORE_1_SP_SPILL_MIN_CLR : WT; bitpos: [8]; default: 0;
 *  Write 1 to clear the interrupt for SP exceeding the lower bound address of SP
 *  monitored region.
 */
#define BUS_MONITOR_CORE_1_SP_SPILL_MIN_CLR    (BIT(8))
#define BUS_MONITOR_CORE_1_SP_SPILL_MIN_CLR_M  (BUS_MONITOR_CORE_1_SP_SPILL_MIN_CLR_V << BUS_MONITOR_CORE_1_SP_SPILL_MIN_CLR_S)
#define BUS_MONITOR_CORE_1_SP_SPILL_MIN_CLR_V  0x00000001U
#define BUS_MONITOR_CORE_1_SP_SPILL_MIN_CLR_S  8
/** BUS_MONITOR_CORE_1_SP_SPILL_MAX_CLR : WT; bitpos: [9]; default: 0;
 *  Write 1 to clear the interrupt for SP exceeding the upper bound address of SP
 *  monitored region.
 */
#define BUS_MONITOR_CORE_1_SP_SPILL_MAX_CLR    (BIT(9))
#define BUS_MONITOR_CORE_1_SP_SPILL_MAX_CLR_M  (BUS_MONITOR_CORE_1_SP_SPILL_MAX_CLR_V << BUS_MONITOR_CORE_1_SP_SPILL_MAX_CLR_S)
#define BUS_MONITOR_CORE_1_SP_SPILL_MAX_CLR_V  0x00000001U
#define BUS_MONITOR_CORE_1_SP_SPILL_MAX_CLR_S  9

/** BUS_MONITOR_CORE_1_AREA_DRAM0_0_MIN_REG register
 *  Configures lower boundary address of region 0 monitored on Data bus
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_MIN_REG (DR_REG_BUS_MONITOR_BASE + 0x98)
/** BUS_MONITOR_CORE_1_AREA_DRAM0_0_MIN : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the lower bound address of Data bus region 0.
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_MIN    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_MIN_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_0_MIN_V << BUS_MONITOR_CORE_1_AREA_DRAM0_0_MIN_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_MIN_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_MIN_S  0

