espressif/esp-idf/components/soc/esp32s31/register/soc/bus_monitor_reg.h
/** BUS_MONITOR_CORE_1_AREA_DRAM0_0_MAX_REG register
 *  Configures upper boundary address of region 0 monitored on Data bus
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_MAX_REG (DR_REG_BUS_MONITOR_BASE + 0x9c)
/** BUS_MONITOR_CORE_1_AREA_DRAM0_0_MAX : R/W; bitpos: [31:0]; default: 0;
 *  Configures the upper bound address of Data bus region 0.
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_MAX    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_MAX_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_0_MAX_V << BUS_MONITOR_CORE_1_AREA_DRAM0_0_MAX_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_MAX_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_DRAM0_0_MAX_S  0

/** BUS_MONITOR_CORE_1_AREA_DRAM0_1_MIN_REG register
 *  Configures lower boundary address of region 1 monitored on Data bus
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_MIN_REG (DR_REG_BUS_MONITOR_BASE + 0xa0)
/** BUS_MONITOR_CORE_1_AREA_DRAM0_1_MIN : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the lower bound address of Data bus region 1.
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_MIN    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_MIN_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_1_MIN_V << BUS_MONITOR_CORE_1_AREA_DRAM0_1_MIN_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_MIN_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_MIN_S  0

/** BUS_MONITOR_CORE_1_AREA_DRAM0_1_MAX_REG register
 *  Configures upper boundary address of region 1 monitored on Data bus
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_MAX_REG (DR_REG_BUS_MONITOR_BASE + 0xa4)
/** BUS_MONITOR_CORE_1_AREA_DRAM0_1_MAX : R/W; bitpos: [31:0]; default: 0;
 *  Configures the upper bound address of Data bus region 1.
 */
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_MAX    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_MAX_M  (BUS_MONITOR_CORE_1_AREA_DRAM0_1_MAX_V << BUS_MONITOR_CORE_1_AREA_DRAM0_1_MAX_S)
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_MAX_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_DRAM0_1_MAX_S  0

/** BUS_MONITOR_CORE_1_AREA_PIF_0_MIN_REG register
 *  Configures lower boundary address of region 0 monitored on Peripheral bus
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_0_MIN_REG (DR_REG_BUS_MONITOR_BASE + 0xa8)
/** BUS_MONITOR_CORE_1_AREA_PIF_0_MIN : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the lower bound address of Peripheral bus region 0.
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_0_MIN    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_PIF_0_MIN_M  (BUS_MONITOR_CORE_1_AREA_PIF_0_MIN_V << BUS_MONITOR_CORE_1_AREA_PIF_0_MIN_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_0_MIN_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_PIF_0_MIN_S  0

/** BUS_MONITOR_CORE_1_AREA_PIF_0_MAX_REG register
 *  Configures upper boundary address of region 0 monitored on Peripheral bus
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_0_MAX_REG (DR_REG_BUS_MONITOR_BASE + 0xac)
/** BUS_MONITOR_CORE_1_AREA_PIF_0_MAX : R/W; bitpos: [31:0]; default: 0;
 *  Configures the upper bound address of Peripheral bus region 0.
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_0_MAX    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_PIF_0_MAX_M  (BUS_MONITOR_CORE_1_AREA_PIF_0_MAX_V << BUS_MONITOR_CORE_1_AREA_PIF_0_MAX_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_0_MAX_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_PIF_0_MAX_S  0

/** BUS_MONITOR_CORE_1_AREA_PIF_1_MIN_REG register
 *  Configures lower boundary address of region 1 monitored on Peripheral bus
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_1_MIN_REG (DR_REG_BUS_MONITOR_BASE + 0xb0)
/** BUS_MONITOR_CORE_1_AREA_PIF_1_MIN : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the lower bound address of Peripheral bus region 1.
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_1_MIN    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_PIF_1_MIN_M  (BUS_MONITOR_CORE_1_AREA_PIF_1_MIN_V << BUS_MONITOR_CORE_1_AREA_PIF_1_MIN_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_1_MIN_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_PIF_1_MIN_S  0

/** BUS_MONITOR_CORE_1_AREA_PIF_1_MAX_REG register
 *  Configures upper boundary address of region 1 monitored on Peripheral bus
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_1_MAX_REG (DR_REG_BUS_MONITOR_BASE + 0xb4)
/** BUS_MONITOR_CORE_1_AREA_PIF_1_MAX : R/W; bitpos: [31:0]; default: 0;
 *  Configures the upper bound address of Peripheral bus region 1.
 */
#define BUS_MONITOR_CORE_1_AREA_PIF_1_MAX    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_PIF_1_MAX_M  (BUS_MONITOR_CORE_1_AREA_PIF_1_MAX_V << BUS_MONITOR_CORE_1_AREA_PIF_1_MAX_S)
#define BUS_MONITOR_CORE_1_AREA_PIF_1_MAX_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_PIF_1_MAX_S  0

/** BUS_MONITOR_CORE_1_AREA_PC_REG register
 *  Region monitoring HP CPU PC status register
 */
#define BUS_MONITOR_CORE_1_AREA_PC_REG (DR_REG_BUS_MONITOR_BASE + 0xb8)
/** BUS_MONITOR_CORE_1_AREA_PC : RO; bitpos: [31:0]; default: 0;
 *  Represents the PC value when an interrupt is triggered during region monitoring.
 */
#define BUS_MONITOR_CORE_1_AREA_PC    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_PC_M  (BUS_MONITOR_CORE_1_AREA_PC_V << BUS_MONITOR_CORE_1_AREA_PC_S)
#define BUS_MONITOR_CORE_1_AREA_PC_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_PC_S  0

/** BUS_MONITOR_CORE_1_AREA_SP_REG register
 *  Region monitoring HP CPU SP status register
 */
#define BUS_MONITOR_CORE_1_AREA_SP_REG (DR_REG_BUS_MONITOR_BASE + 0xbc)
/** BUS_MONITOR_CORE_1_AREA_SP : RO; bitpos: [31:0]; default: 0;
 *  Represents the SP value when an interrupt is triggered during region monitoring.
 */
#define BUS_MONITOR_CORE_1_AREA_SP    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_SP_M  (BUS_MONITOR_CORE_1_AREA_SP_V << BUS_MONITOR_CORE_1_AREA_SP_S)
#define BUS_MONITOR_CORE_1_AREA_SP_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_AREA_SP_S  0

/** BUS_MONITOR_CORE_1_SP_MIN_REG register
 *  Configures stack monitoring lower boundary address
 */
#define BUS_MONITOR_CORE_1_SP_MIN_REG (DR_REG_BUS_MONITOR_BASE + 0xc0)
/** BUS_MONITOR_CORE_1_SP_MIN : R/W; bitpos: [31:0]; default: 0;
 *  Configures the lower bound address of SP.
 */
#define BUS_MONITOR_CORE_1_SP_MIN    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_SP_MIN_M  (BUS_MONITOR_CORE_1_SP_MIN_V << BUS_MONITOR_CORE_1_SP_MIN_S)
#define BUS_MONITOR_CORE_1_SP_MIN_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_SP_MIN_S  0

