espressif/esp-idf/components/soc/esp32s31/register/soc/bus_monitor_reg.h
/** BUS_MONITOR_CORE_1_SP_MAX_REG register
 *  Configures stack monitoring upper boundary address
 */
#define BUS_MONITOR_CORE_1_SP_MAX_REG (DR_REG_BUS_MONITOR_BASE + 0xc4)
/** BUS_MONITOR_CORE_1_SP_MAX : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the upper bound address of SP.
 */
#define BUS_MONITOR_CORE_1_SP_MAX    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_SP_MAX_M  (BUS_MONITOR_CORE_1_SP_MAX_V << BUS_MONITOR_CORE_1_SP_MAX_S)
#define BUS_MONITOR_CORE_1_SP_MAX_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_SP_MAX_S  0

/** BUS_MONITOR_CORE_1_SP_PC_REG register
 *  Stack monitoring HP CPU PC status register
 */
#define BUS_MONITOR_CORE_1_SP_PC_REG (DR_REG_BUS_MONITOR_BASE + 0xc8)
/** BUS_MONITOR_CORE_1_SP_PC : RO; bitpos: [31:0]; default: 0;
 *  Represents the PC value during stack monitoring.
 */
#define BUS_MONITOR_CORE_1_SP_PC    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_SP_PC_M  (BUS_MONITOR_CORE_1_SP_PC_V << BUS_MONITOR_CORE_1_SP_PC_S)
#define BUS_MONITOR_CORE_1_SP_PC_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_SP_PC_S  0

/** BUS_MONITOR_CORE_1_RCD_EN_REG register
 *  HP CPU PC logging enable register
 */
#define BUS_MONITOR_CORE_1_RCD_EN_REG (DR_REG_BUS_MONITOR_BASE + 0xcc)
/** BUS_MONITOR_CORE_1_RCD_RECORDEN : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable PC and SP logging.
 *  0: Disable
 *  1: ASSIST_DEBUG_CORE_1_RCD_PDEBUGPC_REG starts to record PC in real time,
 *  BUS_MONITOR_CORE_1_RCD_PDEBUGSP_REG starts to record SP in real time
 */
#define BUS_MONITOR_CORE_1_RCD_RECORDEN    (BIT(0))
#define BUS_MONITOR_CORE_1_RCD_RECORDEN_M  (BUS_MONITOR_CORE_1_RCD_RECORDEN_V << BUS_MONITOR_CORE_1_RCD_RECORDEN_S)
#define BUS_MONITOR_CORE_1_RCD_RECORDEN_V  0x00000001U
#define BUS_MONITOR_CORE_1_RCD_RECORDEN_S  0
/** BUS_MONITOR_CORE_1_RCD_PDEBUGEN : R/W; bitpos: [1]; default: 0;
 *  Configures whether to enable HP CPU debugging.
 *  0: Disable
 *  1: HP CPU outputs PC
 */
#define BUS_MONITOR_CORE_1_RCD_PDEBUGEN    (BIT(1))
#define BUS_MONITOR_CORE_1_RCD_PDEBUGEN_M  (BUS_MONITOR_CORE_1_RCD_PDEBUGEN_V << BUS_MONITOR_CORE_1_RCD_PDEBUGEN_S)
#define BUS_MONITOR_CORE_1_RCD_PDEBUGEN_V  0x00000001U
#define BUS_MONITOR_CORE_1_RCD_PDEBUGEN_S  1

/** BUS_MONITOR_CORE_1_RCD_PDEBUGPC_REG register
 *  PC logging register
 */
#define BUS_MONITOR_CORE_1_RCD_PDEBUGPC_REG (DR_REG_BUS_MONITOR_BASE + 0xd0)
/** BUS_MONITOR_CORE_1_RCD_PDEBUGPC : RO; bitpos: [31:0]; default: 0;
 *  Represents the PC value at HP CPU reset.
 */
#define BUS_MONITOR_CORE_1_RCD_PDEBUGPC    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_RCD_PDEBUGPC_M  (BUS_MONITOR_CORE_1_RCD_PDEBUGPC_V << BUS_MONITOR_CORE_1_RCD_PDEBUGPC_S)
#define BUS_MONITOR_CORE_1_RCD_PDEBUGPC_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_RCD_PDEBUGPC_S  0

/** BUS_MONITOR_CORE_1_RCD_PDEBUGSP_REG register
 *  PC logging register
 */
#define BUS_MONITOR_CORE_1_RCD_PDEBUGSP_REG (DR_REG_BUS_MONITOR_BASE + 0xd4)
/** BUS_MONITOR_CORE_1_RCD_PDEBUGSP : RO; bitpos: [31:0]; default: 0;
 *  Represents SP.
 */
#define BUS_MONITOR_CORE_1_RCD_PDEBUGSP    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_RCD_PDEBUGSP_M  (BUS_MONITOR_CORE_1_RCD_PDEBUGSP_V << BUS_MONITOR_CORE_1_RCD_PDEBUGSP_S)
#define BUS_MONITOR_CORE_1_RCD_PDEBUGSP_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_RCD_PDEBUGSP_S  0

/** BUS_MONITOR_CORE_1_LASTPC_BEFORE_EXCEPTION_REG register
 *  cpu status register
 */
#define BUS_MONITOR_CORE_1_LASTPC_BEFORE_EXCEPTION_REG (DR_REG_BUS_MONITOR_BASE + 0xe8)
/** BUS_MONITOR_CORE_1_LASTPC_BEFORE_EXC : RO; bitpos: [31:0]; default: 0;
 *  Represents the PC of the last command before the HP CPU enters exception.
 */
#define BUS_MONITOR_CORE_1_LASTPC_BEFORE_EXC    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_LASTPC_BEFORE_EXC_M  (BUS_MONITOR_CORE_1_LASTPC_BEFORE_EXC_V << BUS_MONITOR_CORE_1_LASTPC_BEFORE_EXC_S)
#define BUS_MONITOR_CORE_1_LASTPC_BEFORE_EXC_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_LASTPC_BEFORE_EXC_S  0

/** BUS_MONITOR_CORE_1_DEBUG_MODE_REG register
 *  cpu status register
 */
#define BUS_MONITOR_CORE_1_DEBUG_MODE_REG (DR_REG_BUS_MONITOR_BASE + 0xec)
/** BUS_MONITOR_CORE_1_DEBUG_MODE : RO; bitpos: [0]; default: 0;
 *  Represents whether RISC-V CPU (HP CPU) is in debugging mode.
 *  1: In debugging mode
 *  0: Not in debugging mode
 */
#define BUS_MONITOR_CORE_1_DEBUG_MODE    (BIT(0))
#define BUS_MONITOR_CORE_1_DEBUG_MODE_M  (BUS_MONITOR_CORE_1_DEBUG_MODE_V << BUS_MONITOR_CORE_1_DEBUG_MODE_S)
#define BUS_MONITOR_CORE_1_DEBUG_MODE_V  0x00000001U
#define BUS_MONITOR_CORE_1_DEBUG_MODE_S  0
/** BUS_MONITOR_CORE_1_DEBUG_MODULE_ACTIVE : RO; bitpos: [1]; default: 0;
 *  Represents the status of the RISC-V CPU (HP CPU) debug module.
 *  1: Active status
 *  Other: Inactive status
 */
#define BUS_MONITOR_CORE_1_DEBUG_MODULE_ACTIVE    (BIT(1))
#define BUS_MONITOR_CORE_1_DEBUG_MODULE_ACTIVE_M  (BUS_MONITOR_CORE_1_DEBUG_MODULE_ACTIVE_V << BUS_MONITOR_CORE_1_DEBUG_MODULE_ACTIVE_S)
#define BUS_MONITOR_CORE_1_DEBUG_MODULE_ACTIVE_V  0x00000001U
#define BUS_MONITOR_CORE_1_DEBUG_MODULE_ACTIVE_S  1

/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_CAUSE_0_REG register
 *  TRACE lockup cause logging register
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_CAUSE_0_REG (DR_REG_BUS_MONITOR_BASE + 0xf0)
/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_CAUSE_0 : RO; bitpos: [11:0]; default: 0;
 *  Represents the latest lockup cause
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_CAUSE_0    0x00000FFFU
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_CAUSE_0_M  (BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_CAUSE_0_V << BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_CAUSE_0_S)
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_CAUSE_0_V  0x00000FFFU
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_CAUSE_0_S  0

/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_TVAL_0_REG register
 *  TRACE lockup tval logging register
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_TVAL_0_REG (DR_REG_BUS_MONITOR_BASE + 0xf4)
/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_TVAL_0 : RO; bitpos: [31:0]; default: 0;
 *  Represents the latest lockup tval
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_TVAL_0    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_TVAL_0_M  (BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_TVAL_0_V << BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_TVAL_0_S)
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_TVAL_0_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_TVAL_0_S  0

/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_IADDR_0_REG register
 *  TRACE lockup iaddr logging register
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_IADDR_0_REG (DR_REG_BUS_MONITOR_BASE + 0xf8)
/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_IADDR_0 : RO; bitpos: [31:0]; default: 0;
 *  Represents the latest lockup iaddr
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_IADDR_0    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_IADDR_0_M  (BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_IADDR_0_V << BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_IADDR_0_S)
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_IADDR_0_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_IADDR_0_S  0

/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_PRIV_0_REG register
 *  TRACE lockup priv logging register
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_PRIV_0_REG (DR_REG_BUS_MONITOR_BASE + 0xfc)
/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_PRIV_0 : RO; bitpos: [1:0]; default: 0;
 *  Represents the latest lockup priv
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_PRIV_0    0x00000003U
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_PRIV_0_M  (BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_PRIV_0_V << BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_PRIV_0_S)
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_PRIV_0_V  0x00000003U
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_PRIV_0_S  0

/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_CAUSE_1_REG register
 *  TRACE lockup cause logging register
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_CAUSE_1_REG (DR_REG_BUS_MONITOR_BASE + 0x100)
/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_CAUSE_1 : RO; bitpos: [11:0]; default: 0;
 *  Represents the last lockup cause
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_CAUSE_1    0x00000FFFU
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_CAUSE_1_M  (BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_CAUSE_1_V << BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_CAUSE_1_S)
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_CAUSE_1_V  0x00000FFFU
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_CAUSE_1_S  0

/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_TVAL_1_REG register
 *  TRACE lockup tval logging register
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_TVAL_1_REG (DR_REG_BUS_MONITOR_BASE + 0x104)
/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_TVAL_1 : RO; bitpos: [31:0]; default: 0;
 *  Represents the last lockup tval
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_TVAL_1    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_TVAL_1_M  (BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_TVAL_1_V << BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_TVAL_1_S)
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_TVAL_1_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_TVAL_1_S  0

