espressif/esp-idf/components/soc/esp32s31/register/soc/bus_monitor_reg.h
/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_IADDR_1_REG register
 *  TRACE lockup iaddr logging register
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_IADDR_1_REG (DR_REG_BUS_MONITOR_BASE + 0x108)
/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_IADDR_1 : RO; bitpos: [31:0]; default: 0;
 *  Represents the last lockup iaddr
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_IADDR_1    0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_IADDR_1_M  (BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_IADDR_1_V << BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_IADDR_1_S)
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_IADDR_1_V  0xFFFFFFFFU
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_IADDR_1_S  0

/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_PRIV_1_REG register
 *  TRACE lockup priv logging register
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_PRIV_1_REG (DR_REG_BUS_MONITOR_BASE + 0x10c)
/** BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_PRIV_1 : RO; bitpos: [1:0]; default: 0;
 *  Represents the last lockup priv
 */
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_PRIV_1    0x00000003U
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_PRIV_1_M  (BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_PRIV_1_V << BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_PRIV_1_S)
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_PRIV_1_V  0x00000003U
#define BUS_MONITOR_CORE_1_TRACE_LOCKUP_RECORDING_PRIV_1_S  0

/** BUS_MONITOR_CORE_X_IRAM0_DRAM0_EXCEPTION_MONITOR_0_REG register
 *  exception monitor status register
 */
#define BUS_MONITOR_CORE_X_IRAM0_DRAM0_EXCEPTION_MONITOR_0_REG (DR_REG_BUS_MONITOR_BASE + 0x110)
/** BUS_MONITOR_CORE_X_IRAM0_DRAM0_LIMIT_CYCLE_0 : R/W; bitpos: [19:0]; default: 0;
 *  reg_core_x_iram0_dram0_limit_cycle_0
 */
#define BUS_MONITOR_CORE_X_IRAM0_DRAM0_LIMIT_CYCLE_0    0x000FFFFFU
#define BUS_MONITOR_CORE_X_IRAM0_DRAM0_LIMIT_CYCLE_0_M  (BUS_MONITOR_CORE_X_IRAM0_DRAM0_LIMIT_CYCLE_0_V << BUS_MONITOR_CORE_X_IRAM0_DRAM0_LIMIT_CYCLE_0_S)
#define BUS_MONITOR_CORE_X_IRAM0_DRAM0_LIMIT_CYCLE_0_V  0x000FFFFFU
#define BUS_MONITOR_CORE_X_IRAM0_DRAM0_LIMIT_CYCLE_0_S  0

/** BUS_MONITOR_CLOCK_GATE_REG register
 *  Register clock control
 */
#define BUS_MONITOR_CLOCK_GATE_REG (DR_REG_BUS_MONITOR_BASE + 0x114)
/** BUS_MONITOR_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether to enable the register clock gating.
 *  0: Disable
 *  1: Enable
 */
#define BUS_MONITOR_CLK_EN    (BIT(0))
#define BUS_MONITOR_CLK_EN_M  (BUS_MONITOR_CLK_EN_V << BUS_MONITOR_CLK_EN_S)
#define BUS_MONITOR_CLK_EN_V  0x00000001U
#define BUS_MONITOR_CLK_EN_S  0

/** BUS_MONITOR_DATE_REG register
 *  Version control register
 */
#define BUS_MONITOR_DATE_REG (DR_REG_BUS_MONITOR_BASE + 0x3fc)
/** BUS_MONITOR_DATE : R/W; bitpos: [27:0]; default: 34640176;
 *  version register
 */
#define BUS_MONITOR_DATE    0x0FFFFFFFU
#define BUS_MONITOR_DATE_M  (BUS_MONITOR_DATE_V << BUS_MONITOR_DATE_S)
#define BUS_MONITOR_DATE_V  0x0FFFFFFFU
#define BUS_MONITOR_DATE_S  0

#ifdef __cplusplus
}
#endif
